// Room: /d/baolian/zen.c

inherit ROOM;

void create()
{
	set("short", "禪院");
	set("long", @LONG
這是寶蓮寺僧人靜坐參禪的禪院﹐一方淨室四壁素白﹐窗明几淨
﹐纖塵不染。地上整齊排著一列蒲團﹐供僧人盤膝趺坐。北面牆上掛著
一幅水墨觀音像﹐寶相慈悲﹐淨瓶楊柳﹐普灑甘露。室角一座小香爐燃
著沉香﹐青煙筆直上升﹐久久不散。室中靜謐安詳﹐唯有窗外松濤與簷
角鈴響﹐越顯清幽。僧人在此參禪入定﹐收攝心神﹐參悟善想禪法。往
西可回到庭院。
LONG
	);
	set("detail", ([
		"蒲團" : "一列蒲團以蒲草精心編成﹐邊緣已被磨得光亮﹐想是僧人經年
累月趺坐參禪所致。
",
		"觀音" : "水墨觀音像筆意慈和﹐畫中觀世音菩薩手持淨瓶楊柳﹐遍灑甘露
﹐慈悲之意令人觀之頓生清淨向善之念。
",
		"香爐" : "室角的小香爐爐中沉香嫋嫋﹐清香淡雅﹐有助凝神入定﹐參悟
禪機。
",
	]));
	set("exits", ([
		"west" : __DIR__"yard",
	]));

	setup();
}
// vim: set ts=4 sw=4 syntax=lpc
