// Room: /d/baixiang/zen.c

inherit ROOM;

void create()
{
	set("short", "禪房");
	set("long", @LONG
這是白象寺僧人坐禪參修的禪房﹐一間淨室素淨無塵﹐地上整齊地
排著一列蒲團﹐供僧人盤膝靜坐。北面牆上掛著一幅水墨達摩面壁圖﹐
牆角一座小香爐燃著沉香﹐青煙筆直上升。室中靜謐無聲﹐唯有窗外風
過鈴響﹐越發顯得清幽。僧人在此參禪打坐﹐收攝心神﹐修習大乘佛法
。往西可回到庭院。
LONG
	);
	set("detail", ([
		"蒲團" : "一列蒲團以蒲草編成﹐邊緣已被磨得發亮﹐想是經年累月坐禪
所致。
",
		"達摩" : "水墨達摩面壁圖筆意蒼勁﹐畫中達摩祖師面壁九年﹐神態淵默﹐
令人觀之頓生靜心參悟之念。
",
		"香爐" : "牆角的小香爐爐中沉香嫋嫋﹐清香淡雅﹐有助凝神入定。
",
	]));
	set("exits", ([
		"west" : __DIR__"yard",
	]));

	setup();
}
// vim: set ts=4 sw=4 syntax=lpc
